@extends('layout')

@section('meta_title') Страница ex2 @endsection
@section('main_content')
    <h1>Задание 2</h1>
    <p>С использованием одного из фреймворков (Laravel, Laminas Mezzio, Symfony, Yii), нужно написать небольшой сервис, у которого будут:</p>
    <p>Эндпоинт, который содержит следующую логику:</p>
    <ul>
        <li>принимает данные в формате json и валидирует входящие данные</li>
        <li>полученные данные содержат имя, фамилию, возраст, пол, телефон и email</li>
        <li>данные попадают в amoCRM через API в соответсвующие поля контакта, у контакта есть связанная сделка, у сделки стоит задача на ответственного пользователя с датой выполнения - через 4 дня после создания сделки, но только на «рабочее время» (пн-пт с 9 до 18)</li>
        <li>у сделки есть связанные товары, 2 штуки, что именно за товары можно определить самому</li>
        <li>ответственным пользователем является случайный пользователь в аккаунте</li>
        <li>должна быть предусмотрена проверка дублей контактов. Уникальным значением считаем телефон. Если контакт уже есть и существующая сделка в успешном статусе (142), то должен быть создан покупатель с существующим контактом</li>
        <li>Страница с формой ввода данных, которая отправляет данные на эндпоинт из первого пункта, страница должна быть отрисована любым шаблонизатором (Twig, Smarty и тд).</li>
    </ul>

    <p><a href="/service">Тестировать сервис</a></p>
@endsection
